backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        users = User.all

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Davis"], ["LIMIT", 1]]
---
    def show
        user = User.find_by(username: params[:username])